module.exports = {
  standart: `🗣️ <b>Команди</b>

/start - отримати привітання від бота
/compliment - отримати комплімент від бота
/help - отримати список усіх можливих команд

Також можна просто написати повідомлення, а я передам його Денису`,
  admin: `🗣️ <b>Команди</b>

💁‍♂️ <b>Стандарті:</b>
/start - отримати привітання від бота
/compliment - отримати комплімент від бота
/help - отримати список усіх можливих команд

⭐️ <b>Адміністраторські:</b>
- add "text" - додати у базу даних новий компліментик з текстом "text";
- show "id" - отримати повну інформацію про компліментик з id "id";
- del "key" "idOrText" - видалити з бази даних повідомлення з полем "key" (id або text) та значенням цього поля "idOrText";
- upd "collection" "id" "field" "value" - оновити поле "field" колекції "collection" (user або compliment) з id "id" в базі даних новим значенням "value";
- mlr "text" - відправити повідомлення Олені Рак з текстом "text";
- msg "name" "surname" "text" - відправити повідомлення користувачу, який є у базі даних, з ім'ям "name", прізвищем "surname" і текстом "text";
- users "page" - отримати масив 20-ти користувачів пагінації "page" з бази даних;
- compliments "page" - отримати масив 20-ти компліментиків пагінації "page" з бази даних;
- /usersq - отримати кількість усіх користувачів у базі даних;
- /complimentsq - отримати кількість усіх компліментів у базі даних;
/test - тестова команда.`,
}
